'use strict';

// ----------------------------------------------------------------------

console.log('%cЗадача №2', background)

const rain = Math.round(Math.random())

if (rain === 1) {
  console.log('Пошёл дождь. Возьмите зонт!')
} else {
  console.log('Дождя нет')
}

// ----------------------------------------------------------------------

console.log('%cЗадача №3', background)

const total = Number(prompt('Введите кол-во баллов по математике: ')) + Number(prompt('Введите кол-во баллов по русскому языку: ')) + Number(prompt('Введите кол-во баллов по информатике: '))

if (total >= 265) {
  console.log('Поздравляю, вы поступили на бюджет!')
} else {
  console.log('Увы, нужно ещё немного подтянуть знания, у вас обязательно всё получится!')
}

// ----------------------------------------------------------------------

console.log('%cЗадача №4', background)

const money = Number(prompt('Сколько денег вы хотите снять?')) % 100

if (money === 0) {
  console.log('Бжжжжжжжжж')
  console.log('Возьмите деньги из лотка')
} else {
  console.log('Введите сумму кратную 100')
}

// ----------------------------------------------------------------------

